In [41]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [42]:
df.columns

Index(['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [43]:
df.drop(['PassengerId', 'Name','SibSp', 'Parch','Ticket', 'Cabin', 'Embarked' ], axis='columns', inplace=True)

In [44]:
y = df['Survived']
X = df.drop(['Survived'], axis=1)

In [45]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [46]:
dummies = pd.get_dummies(X['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [47]:
X = pd.concat([X, dummies], axis='columns')
X.drop(['Sex'], axis='columns', inplace=True)
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [48]:
X.isna().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [49]:
X.Age = X.Age.fillna(X.Age.mean())

In [50]:
X.isna().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [51]:
X.shape

(891, 5)

In [52]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [53]:
X_train.shape, X_test.shape

((712, 5), (179, 5))

In [54]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [55]:
model.fit(X_train, y_train)

GaussianNB()

In [56]:
model.score(X_test, y_test)

0.770949720670391

In [57]:
X_test[:10]

     Pclass   Age     Fare  female  male
257       1  30.0  86.5000       1     0
886       2  27.0  13.0000       0     1
449       1  52.0  30.5000       0     1
280       3  65.0   7.7500       0     1
774       2  54.0  23.0000       1     0
52        1  49.0  76.7292       1     0
148       2  36.5  26.0000       0     1
333       3  16.0  18.0000       0     1
422       3  29.0   7.8750       0     1
421       3  21.0   7.7333       0     1

In [58]:
y_test[:10]

257    1
886    0
449    1
280    0
774    1
52     1
148    0
333    0
422    0
421    0
Name: Survived, dtype: int64

In [59]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 1, 1, 0, 0, 0, 0])

In [61]:
v = pd.DataFrame(model.predict_proba(X_test[:10]))

In [62]:
v

          0         1
0  0.000845  0.999155
1  0.977814  0.022186
2  0.901755  0.098245
3  0.985499  0.014501
4  0.021709  0.978291
5  0.001335  0.998665
6  0.977628  0.022372
7  0.987908  0.012092
8  0.990410  0.009590
9  0.989227  0.010773